In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv("Salary Dataset.csv")
df.shape

(4344, 5)

In [3]:
#Check for NaN
df.isnull().values.any()

True

In [4]:
colunas = df.columns
print(colunas)

Index(['Company Name', 'Job Title', 'Salaries Reported', 'Location', 'Salary'], dtype='object')

In [5]:
for i in colunas:
    print('Coluna: %s ; Número de NaN: %s' % (i, df[i].isnull().sum()))

Coluna: Company Name ; Número de NaN: 3
Coluna: Job Title ; Número de NaN: 0
Coluna: Salaries Reported ; Número de NaN: 2
Coluna: Location ; Número de NaN: 0
Coluna: Salary ; Número de NaN: 0

In [6]:
df[df.isnull().any(axis=1)]

,Company Name,Job Title,Salaries Reported,Location,Salary
2279,NaN,Data Analyst,1.0,Pune,"₹23,500/mo"
3227,NaN,Data Engineer,1.0,Pune,"₹26,20,604/yr"
4026,NaN,Machine Learning Engineer/Data Scientist,1.0,Pune,"₹56,465/mo"
4027,First Student Data Scientist,Data Analyst,NaN,Pune,"₹4,53,300/yr"
4237,Amazon,Machine Learning Data Associate II,NaN,New Delhi,"₹3,29,439/yr"

In [7]:
#How many companies are in Pune
df[df['Location'] == 'Pune']['Company Name'].value_counts()

Tata Consultancy Services       10
Accenture                        8
Infosys                          7
SG Analytics                     6
First Student                    6
                                ..
IEEE Student Branch VIT Pune     1
We Are Novella                   1
Flipper Code                     1
Kushim                           1
Extend Future                    1
Name: Company Name, Length: 567, dtype: int64

In [8]:
df_nonan = df.dropna()
df_nonan.shape
df_nonan = df_nonan.reset_index()

In [9]:
#Same scale yr to month
list_yr = []
i = 0
while i != df_nonan.shape[0]:
    if df_nonan['Salary'][i][-2:] == 'yr':
        list_yr.append(i)
    i += 1

In [33]:
df_nonan["Salary Copy"] = df_nonan["Salary"]
df_nonan["Salary Copy"] = df_nonan["Salary Copy"].str.replace(",", "")
df_nonan["Salary Copy"] = df_nonan["Salary Copy"].str.replace("₹", "")
df_nonan["Salary Copy"] = df_nonan["Salary Copy"].str.replace("/yr", "")
df_nonan["Salary Copy"] = df_nonan["Salary Copy"].str.replace("/mo", "")

In [34]:
df_nonan["Salary Copy"]

0        648573
1       1191950
2        836874
3        669578
4        944110
         ...
4334       5180
4335     751286
4336     410952
4337    1612324
4338     939843
Name: Salary Copy, Length: 4339, dtype: object